import { store } from "./index";

export default {
  namespaced: true,

  state: {
    allDayEvent: {
      allDayEvent_1: {
        event: "終日開催",
        title: "資料配布コーナー",
        place: "2号館丹羽ホール前",
        info: "説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明",
      },
      allDayEvent_2: {
        event: "終日開催",
        title: "施設見学ツアー",
        place: "5号館2階受付",
        info: "説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明",
      },
      allDayEvent_3: {
        event: "終日開催",
        title: "クラブ・サークル紹介",
        place: "？？",
        info: "説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明",
      },
      allDayEvent_4: {
        event: "終日開催",
        title: "学科展示室",
        place: "1号館4階演習室",
        info: "説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明",
      },
      allDayEvent_5: {
        event: "終日開催",
        title: "研究室公開",
        place: "1号館4階演習室／5階メディアラボ",
        info: "説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説明説説明説明説明説明説明説明説明説明説明",
      },
    },
  },
};
