<template>
  <div id="contents" class="py-4 pa-4">
    <div class="pb-2" style="display: flex">
      <div style="margin: 0 0 0 auto">
        <p class="sub-strong">更新日：2023年7月25日</p>
      </div>
    </div>
    <h2>ご利用にあたって</h2>
    <p class="pb-10">
      このウェブサイトhttps://tdu-fi-2023.onrender.com/（以下「本ウェブサイト」といいます）は、東京電機大学大学院
      井ノ上研究室所属の学生（以下「当研究室」といいます）が運営しており、東京電機大学（以下「本校」といいます）の公式ウェブサイトではありません。本ウェブサイトを利用される前に以下の注意点をお読みいただき、ご了解いただいたうえでご利用ください。なお、当研究室は、本ウェブサイトの利用条件を予告なしに変更することがありますので、最新のご利用条件をご確認ください。
    </p>

    <div class="item">
      <h3>1. 免責事項</h3>
      <p>
        本ウェブサイトに掲載された情報に基づいてなされた判断を原因として発生したいかなるトラブル・損失・損害に対しても、当研究室は責任を負いません。また、このサイト内からサイト外へ張られたリンク先の内容についてもその限りではありません。
        本ウェブサイトは、2023年7月29日から同年8月3日までの運営を予定しております。予告なしにウェブサイト運営の中断、中止や内容の変更を行うことがありますが、これらによって生じたいかなるトラブル・損失・損害に対しても責任を負うものではありません。
      </p>
    </div>

    <div class="item">
      <h3>2. 著作権について</h3>
      <p>
        本ウェブサイトに掲載されるすべての情報は、当研究室が著作権を保有し法律により保護されています。個人の私的使用、その他著作権法によって認められる範囲を超えて、これらの情報を使用（複製、改変、転用、アップロード、掲示、送信、頒布、販売、出版を含む）することは、事前に当研究室から許可を得ない限り禁止します。
        また、本ウェブサイトを雑誌書籍、広告などの出版物へ引用掲載される場合は、事前に当研究室まで文章にてお知らせください。その際、お問合せの方のお名前、ご連絡先（住所、電話番号およびメールアドレス）、媒体名、掲載の概要を明記してください。掲載の内容や方法によっては、掲載をお断りすることがありますのでご了承ください。
      </p>
    </div>

    <div class="item">
      <h3>3. リンクについて</h3>
      <p>
        本ウェブサイトから、リンクやバナーによって他のサイトへ移動できる場合があります。移動された先のサイトは当研究室が運営するものではありません。従って、その内容等につきまして当研究室は責任を負いかねますのでご了承ください。
      </p>
    </div>

    <div class="item">
      <h3>4. 推奨環境について</h3>
      <ul>
        <li>
          <b>Webブラウザ<br /> </b>
          本ウェブサイトでは、より快適にご利用いただくために、Google
          Chrome（最新バージョン）でご覧になることを推奨いたします。 （Mozilla
          Firefox 最新バージョン、Safari最新バージョン（Mac OSのみ）、Microsoft
          Edge 最新バージョンでもご覧いただけます。）
          推奨環境以外でのご利用や、推奨環境下でもwebブラウザの設定によってはご利用できない、もしくは正しく表示されない場合がございます。
        </li>
        <li>
          <b>JavaScript<br /> </b>
          本ウェブサイトでは、JavaScriptを使用しているページがございます。お使いのブラウザでJavaScript機能を無効にされている場合、正しく機能しない、もしくは正しく表示されないことがあります。ご覧になる際にはブラウザ設定でJavaScriptを有効にしてください。
          設定方法は各ブラウザのヘルプをご参照ください。
        </li>
        <li>
          <b>スタイルシート<br /> </b>
          本ウェブサイトではスタイルシートを使用しております。お使いのブラウザでスタイルシートを無効にされている場合、正しく表示されないことがあります。ご覧になる際にはブラウザ設定でスタイルシートを有効にしてください。
        </li>
        <li>
          <b>プラグイン<br /> </b>
          本ウェブサイトでは、PDFを用いたコンテンツがあります。ご覧いただくためには、PDF閲覧用ソフトAdobe®Reader®が必要です。Adobe®Reader®は、アドビ社のホームページから無料でダウンロードできます。
          <br />
          <a href="https://get.adobe.com/jp/reader/?loc=jp">▶︎ Adobe®Reader®</a>
        </li>
      </ul>
    </div>

    <!-- <div
      id="attention-mynote"
      style="padding-top: 72px; margin-top: -72px"
    ></div> -->
    <div id="attention-mynote" class="item">
      <h3>5. MyNoteについて</h3>
      <p>
        本ウェブサイトのMyNoteという機能では、登録した項目やメモなどのデータを保存するために「localStorage（ローカルストレージ）」と呼ばれる技術を使用しています。
        ローカルストレージとはWeb
        Storageの一種で、クライアント側（ブラウザ）にデータを<b>永続的</b>に保有します。データを完全に削除するには、ご自身が手動でブラウザから操作する必要があります。また、ブラウザの設定によってはローカルストレージが使用できない場合があります。
        データの完全削除方法および使用条件については、ご自身が利用されているブラウザのヘルプをご参照ください。
        <br />
        <ul class="list-basic">
          <li>
            <a
            href="https://support.google.com/accounts/answer/32050?hl=ja&co=GENIE.Platform%3DDesktop"
          >
            ▶︎ Google Chrome
          </a>
          </li>
          <li><a
            href="https://support.mozilla.org/ja/kb/storage"
          >
            ▶︎ Mozilla Firefox
          </a></li>
          <li><a
            href="https://support.apple.com/ja-jp/HT201265"
          >
            ▶︎ Safari
          </a></li>
          <li><a
            href="https://support.microsoft.com/ja-jp/microsoft-edge/microsoft-edge-%E9%96%B2%E8%A6%A7%E3%83%87%E3%83%BC%E3%82%BF-%E3%81%8A%E3%82%88%E3%81%B3%E3%83%97%E3%83%A9%E3%82%A4%E3%83%90%E3%82%B7%E3%83%BC-b7aa740f-acb8-773a-e46b-7c13681ea3df"
          >
            ▶︎ Microsoft Edge
          </a></li>
        </ul>
        MyNoteに登録した項目やメモの内容は、クリップボードにコピーまたはPDFファイルとして出力できます。データを完全に削除する前にバックアップを取ることを推奨いたします。出力したデータはご自身が責任を持って管理し、外部に掲載されないようお願いいたします。また、MyNoteには個人情報や名誉毀損、プライバシーの侵害、誹謗・中傷を含む事柄は記入しないでください。情報が漏洩した際に上記の理由によって生じたいかなるトラブル・損失・損害に対しても当研究室は責任を負いかねますのであらかじめご了承ください。
      </p>
    </div>

    <div class="item">
      <h3>6. 本ウェブサイトにおける個人情報の取扱いについて</h3>
      <ul>
        <li>
          本ウェブサイトは、ご自身の個人情報を開示することなく訪れていただくことができます。ページを参照しただけでは、個人を識別できる情報が収集されることはありません。ウェブサイトのアクセス数などの利用状況を調べるために統計的な傾向を分析することはありますが、その分析のための情報に個人情報が含まれることはありません。
        </li>
        <li>
          本ウェブサイトは、アンケートにて個人情報を取得します。本人の同意なしに取得することはありません。取得した情報は、以下の目的達成に必要な範囲に限り利用します。
          <h4 >本ウェブサイトを提供／運営するため</h4>
          本ウェブサイトのご提供および運営のために、以下の利用目的に従い、個人情報を利用させていただきます。
          <ul>
            <li>本ウェブサイトの利便性を向上させるため</li>
            <li>本ウェブサイトの不具合を調査／対応するため</li>
          </ul>
          <h4 >不正利用／不正アクセス等の監視／対策のため</h4>
          本ウェブサイトを安心・安全にご利用いただくために、以下の利用目的に従い、個人情報を利用させていただきます。
          <ul >
            <li>
              皆様の情報等を悪用した違法な行為、利用規約の逸脱、不正なアクセス等を監視、調査するため
            </li>
          </ul>
          <h4 >マーケティングデータの調査、統計、分析のため</h4>
          当研究室は、より良いサービスを提供するために、以下の利用目的に従い、個人情報を利用させていただきます。
          <ul >
            <li>本ウェブサイトの利用状況の調査、統計および分析のため</li>
            <li>マーケティング活動の効果測定のため</li>
            <li>
              本ウェブサイトの利便性の向上その他サービスの品質改善のため（そのために実施されるマーケティングデータの調査、統計、分析を含みます。）
            </li>
            <li>
              新サービス、または本ウェブサイトの新機能および新コンテンツ等の企画開発のため（そのために実施されるマーケティングデータの調査、統計、分析を含みます。）
            </li>
          </ul>
        </li>
        <li>
          個人情報は、法令に基づくとき、本人の同意があるとき等を除き、第三者に提供いたしません。また、個人情報は、正確かつ安全に管理します。
        </li>
        <li>
          本ウェブサイト上に外部のサイトへのリンクが貼られることがあります。この外部のサイトで登録される個人情報は、当研究室で管轄する情報ではない為、一切の責任を負うことができません。
          外部のサイトで個人情報を登録される場合は、そのサイトのプライバシーポリシーをご確認ください。
        </li>
      </ul>
    </div>

    <div class="item">
      <h3>7. 皆様へのお願い</h3>
      <p>
        本ウェブサイトは、期間限定公開であるため、パスワードで保護してあります。パスワードは、ご自身が責任を持って管理し、外部に掲載されないようお願いいたします。また、本ウェブサイト上に、他の方やご自身の個人情報は掲載されないようお願いいたします。
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "AttentionView",
  components: {},
};
</script>

<style scoped>
#contents {
  background-color: white;
  min-height: 100dvh;
}
.item {
  padding-bottom: 32px;
}
ul {
  list-style: none;
  margin: 0;
  padding: 0;
}
ul:not(.list-basic) {
  list-style-type: disc;
  padding-left: 1rem;
}

.list-basic{
  margin:4px 0;
}
.list-basic > li{
  margin:0;
}

h2 {
  padding-bottom: 16px;
}
h3 {
  padding-bottom: 12px;
}

h4{
  padding-top: 8px;
}

ul > li {
  margin-bottom: 8px;
}
ul > li > ul{
  margin-bottom:4px;
}
ul > li > ul > li {
  margin-top: 4px;
  margin-bottom: 0;
}
</style>
